##
# Dependencies
##
brew 'coreutils' # GNU core utilities
brew 'curl'
brew 'git'
brew 'imagemagick'
brew 'fzf' # Fast fuzzy finder
brew 'neovim'
brew 'postgresql'
brew 'rcm' # Dotfile management
brew 'tmux' # Terminal multiplexer

##
# Development tools
##
brew 'redis'
brew 'overmind' # Process manager for Procfile-based applications

##
# Utilities
##
brew 'cowsay'
brew 'fortune'
brew 'jandedobbeleer/oh-my-posh/oh-my-posh' # Easier prompt customization
brew 'reattach-to-user-namespace' # Fix for tmux copy/paste