##
# Dependencies
##
brew 'coreutils' # GNU core utilities
brew 'curl'
brew 'git'
brew 'fzf' # Fast fuzzy finder
brew 'mise' # Tool version manager
brew 'neovim'
brew 'postgresql@16'
brew 'rcm' # Dotfile management
brew 'ripgrep'

##
# Applications
##
cask '1password'
cask '1password-cli'
cask 'bettermouse'
cask 'dash' # API documentation browser
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github' # GitHub Desktop
cask 'google-chrome'
cask 'imageoptim' # Image optimization
cask 'insomnia' # API testing
cask 'raycast' # Alfred replacement
cask 'slack'
cask 'tableplus' # Database management
cask 'the-unarchiver' # Unzip utility
cask 'visual-studio-code'
cask 'wezterm'
cask 'zoom'

##
# Utilities
##
brew 'jandedobbeleer/oh-my-posh/oh-my-posh' # Easier zsh prompt customization